function func(s, a, b) {
  // eval не работает т.к. отсутствует код в кавычках
    eval('')
  // объявление переменных и присвоение значений
    let i = -1, j = -1, r = -1;
  // Проверка типа данных для "s", если не строка или массив возвращает -1. 
    if (typeof s[0] === 'undefined') {
      return s.length + i;
    }
  // Поиск в слове(или массиве) "s" необходимых символов(элементов для массива) "a".
  // Определение сколько символов(элементов в массиве) предшествует "a". 
    for (i = s.length - 1; i > -1; i--) {
      for (var x = a.length - 1; x > -1; x--) {
        if (s[i + x] !== a[x]) break;
      }
      if (r === -1 && x === -1) {
        r = i;
      };
    }
  // Поиск в слове(или массиве) "s" необходимых символов(элементов для массива) "b". 
  // Определение сколько символов(элементов в массиве) предшествует "b". 
    for (j = s.length - 1; j > -1; j--) {
      let y = 0;
      while (y < b.length && b[y] === s[j + y]) {
        y++
      };
      if (y === b.length && s[j + y - 1]) {
        break;
      }
    }
  // Сравнение данных значений для а и b.
  // Возвращает максимального числа предшествующих эллементов при отсутствии совпадений возвращает -1.
    if (r === -1) {
      return j;
    } else {
      if (j === -1) {
        return r;
      } else {
        if (r - j > 0) {
          return r;
        } else {
          return j;
        }
      }
    }
  }